[["0",{"pageContent":"Walmart plans to close half its stores in Chicago, a reversal of the retail giant’s high-profile commitment in 2020 to expand in the city as part of its corporate racial justice initiative in the wake of George Floyd’s murder by police.\r\n\r\nWalmart announced Tuesday that next week it will close four poor-performing stores out of the eight it operates in Chicago. The locations are in Chicago’s South and West Side neighborhoods, which are predominantly minority and have long struggled with grocery and retail access.\r\n\r\nThe announcement comes after Walmart highlighted its efforts in Chicago as a “critical part” of its broader $100 million pledge to advancing racial equity in 2020.\r\n\r\n“Chicago will be an example of what’s possible when we leverage business, government and community organizations for the good of all,” Walmart CEO Doug McMillon said in 2021.\r\n\r\nIt also follows more than a decade of intense efforts by Chicago political leaders to draw Walmart and other chains to underserved areas to spur economic development.","metadata":{"source":"C:\\Users\\USER\\Documents\\GitHub\\chatbot-ui\\uploadedFiles\\cnn.txt","loc":{"lines":{"from":1,"to":9}}}}],["1",{"pageContent":"David Merriman, a professor of public policy, management and analytics at the University of Illinois Chicago, found in a 2012 study of Walmart’s impact in Chicago that businesses closer to Walmart were significantly more likely to close than similar businesses farther away. The study also found that the number of jobs lost by nearby retail competitors essentially offset the number of jobs created at the new Walmart stores.\r\n\r\n“Communities around the city shouldn’t see Walmart or other big-box retailers as a panacea for local economic problems,” he said.","metadata":{"source":"C:\\Users\\USER\\Documents\\GitHub\\chatbot-ui\\uploadedFiles\\cnn2.txt","loc":{"lines":{"from":1,"to":3}}}}],["2",{"pageContent":"Sir Mizi is a famous singer 32 years old live in Israel\n\nbio Sir Mizi","metadata":{"source":"C:\\Users\\USER\\Documents\\GitHub\\chatbot-ui\\uploadedFiles\\new_document.pdf","pdf":{"version":"3.4.120","info":{"PDFFormatVersion":"1.5","Language":null,"EncryptFilterName":null,"IsLinearized":false,"IsAcroFormPresent":false,"IsXFAPresent":false,"IsCollectionPresent":false,"IsSignaturesPresent":false,"Creator":"","Producer":"3.0.0.M10 (5.0.0.M6) ","CreationDate":"D:20220404135153+02'00'","ModDate":"D:20230418010000+02'00'","Keywords":"","Title":"","Author":"","Subject":""},"metadata":null,"totalPages":1},"loc":{"pageNumber":1,"lines":{"from":1,"to":3}}}}]]